Fix mermaid diags
